Catalogs/ИА_ЗапросыДанныхФондов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_ЗапросыДанныхФондов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабПараметровЗапроса</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимСКД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Таблица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регистр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеСКД</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроек</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Comment>Организации</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификационныйНомерПлательщикаЕвропейскогоНДС</Name>
					<Comment>VAT Number</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кассир</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяНастройкаИнтеркампани</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиИнтеркампани</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СистемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСистемНалогообложенияККТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДСПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ОсновнаяЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ОсновнойСайт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ОсновнойТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ФактическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ЮридическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЛоготип</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлПечать</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлПодписьГлавногоБухгалтера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлПодписьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяПлательщикомНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОрганизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИА_ЗапросыДанныхФондов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОткрытьКонструкторЗапроса(Команда)
	
	Попытка
		Если ПустаяСтрока(Объект.ТекстЗапроса) Тогда 
			КонструкторЗапроса = Новый КонструкторЗапроса();
		Иначе
			КонструкторЗапроса = Новый КонструкторЗапроса(Объект.ТекстЗапроса);
		КонецЕсли;	
		
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки; 
	
	КонструкторЗапроса.Показать(Новый ОписаниеОповещения("ПриЗакрытииКонструктораЗапроса", ЭтаФорма));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииКонструктораЗапроса(ТЗ, ДополнительныеПараметры) Экспорт
	
	Если ТЗ = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Если ТЗ = Объект.ТекстЗапроса Тогда
		Возврат; 
	КонецЕсли; 
	
	Модифицированность = Истина;
	Объект.ТекстЗапроса = ТЗ;
	
	ТекстЗапроса.УстановитьФорматированнуюСтроку(ПолучитьРаскрашенныйТекст(ТЗ));
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьРаскрашенныйТекст(Знач ТЗ) Экспорт 
	
	Цвет_КлючевыеСлова = WebЦвета.Синий;
	Цвет_Функции = WebЦвета.ТемноБордовый;
	Цвет_Комментарии = WebЦвета.Зеленый;
	Цвет_Параметр = WebЦвета.ЦианНейтральный;
	Цвет_Число = WebЦвета.Фуксия;
	Цвет_Текст = WebЦвета.Черный;
	
	СимволыНПП = Символы.НПП;
	
	ТЗ = СтрЗаменить(ТЗ, Символы.Таб, "    ");
	ТЗ = СтрЗаменить(ТЗ, СимволыНПП, " ");
	МассивФМС = Новый Массив;
	
	МассивСтрок = ИзСтрокиСРазделителями(ТЗ, Символы.ПС);
	КолСтрок = МассивСтрок.Количество();
	Для индСтрока = 0 По КолСтрок - 1 Цикл
		
		стрСтрока = МассивСтрок[индСтрока];
		
		Если Лев(СокрЛ(стрСтрока), 2)	= "//" Тогда
			МассивФМС.Добавить(Новый Структура("Строка, Цвет", стрСтрока, Цвет_Комментарии));
		Иначе
			ПроверяемаяСтрока = ВРег(стрСтрока);
			Если форматирование_ЭтоПолноеКлючевоеСлово(ПроверяемаяСтрока) Тогда
				МассивФМС.Добавить(Новый Структура("Строка, Цвет", ПроверяемаяСтрока, Цвет_КлючевыеСлова));
			Иначе
				
				МассивСлов = ПолучитьСписокСлов(стрСтрока);
				КолСлов = МассивСлов.Количество();
				Для индСлово = 0 По КолСлов - 1 Цикл
					
					стрСлово = МассивСлов[индСлово];
					
					Если ТипЗнч(стрСлово) = Тип("Структура") Тогда
						МассивФМС.Добавить(стрСлово);
						Продолжить;
					КонецЕсли;
					
					ПроверяемоеСлово = ВРег(стрСлово);
					
					Если форматирование_ЭтоПараметр(стрСлово) Тогда
						МассивФМС.Добавить(Новый Структура("Строка, Цвет", стрСлово, Цвет_Параметр));
					ИначеЕсли форматирование_ЭтоКлючевоеСлово(ПроверяемоеСлово) Тогда
						МассивФМС.Добавить(Новый Структура("Строка, Цвет", ПроверяемоеСлово, Цвет_КлючевыеСлова));
					ИначеЕсли форматирование_ЭтоФункция(ПроверяемоеСлово) Тогда
						МассивФМС.Добавить(Новый Структура("Строка, Цвет", ПроверяемоеСлово,Цвет_Функции));
					ИначеЕсли форматирование_ЭтоЧисло(стрСлово) Тогда
						МассивФМС.Добавить(Новый Структура("Строка, Цвет", стрСлово, Цвет_Число));
					Иначе  
						МассивФМС.Добавить(Новый Структура("Строка, Цвет", стрСлово, Цвет_Текст));
					КонецЕсли; 
					
				КонецЦикла;
			КонецЕсли; 
			
		КонецЕсли; 
		
		Если индСтрока < КолСтрок - 1 Тогда
			МассивФМС.Добавить(Новый Структура("Строка, Цвет", Символы.ПС, ""));
		КонецЕсли; 
		
	КонецЦикла; 
	
	Если МассивФМС.Количество() = 0 Тогда
		Возврат Новый ФорматированнаяСтрока("");
	КонецЕсли;
	
	ФМС_Строка = "";
	ПредЦвет = МассивФМС[0].Цвет;
	Если ПредЦвет = "" Тогда
		ПредЦвет = Цвет_Текст;
	КонецЕсли;
	ФМС = Новый ФорматированнаяСтрока("");
	МассивФМСРез= Новый Массив;
	
	Для Каждого стрСлово Из МассивФМС Цикл
		Если стрСлово.Цвет = "" ИЛИ ПредЦвет = стрСлово.Цвет Тогда
			ФМС_Строка = ФМС_Строка + стрСлово.Строка;	
		Иначе
			Если ПредЦвет = Цвет_Текст Тогда
				МассивФМСРез.Добавить(ФМС_Строка);
			Иначе
				МассивФМСРез.Добавить(Новый ФорматированнаяСтрока(ФМС_Строка,,ПредЦвет));
			КонецЕсли;
			
			ФМС_Строка = стрСлово.Строка;
			ПредЦвет = стрСлово.Цвет;
		КонецЕсли; 
	КонецЦикла;
	Если ПредЦвет = Цвет_Текст Тогда
		МассивФМСРез.Добавить(ФМС_Строка);
	Иначе
		МассивФМСРез.Добавить(Новый ФорматированнаяСтрока(ФМС_Строка,,ПредЦвет));
	КонецЕсли;
	
	Возврат Новый ФорматированнаяСтрока(МассивФМСРез);
	
КонецФункции

&НаКлиенте
Функция ИзСтрокиСРазделителями(Знач вхСтр, вхРазделитель)
	
	Массив = Новый Массив;
	вхСтр = СтрЗаменить(вхСтр, вхРазделитель, Символы.ПС);
	ЧислоСтрок = СтрЧислоСтрок(вхСтр);
	Для Счетчик = 1 По ЧислоСтрок Цикл 
		Массив.Добавить(СтрПолучитьСтроку(вхСтр, Счетчик));
	КонецЦикла;
	Возврат Массив;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСписокСлов(Знач вхСтр)
	
	Цвет_КлючевыеСлова = WebЦвета.Синий;
	Цвет_Строка = WebЦвета.Красный;
	
	МассивРезультат = Новый Массив;
	
	ТекущееСлово = "";
	СтрДлинаСтр = СтрДлина(вхСтр);
	
	Для Поз = 1 По СтрДлинаСтр Цикл
		ТекущийСимвол = Сред(вхСтр, Поз, 1);
		
		Если ТекущийСимвол = " " Тогда
			
			Если ЗначениеЗаполнено(ТекущееСлово) Тогда
				МассивРезультат.Добавить(ТекущееСлово);
				ТекущееСлово = "";
			КонецЕсли;
			
			Пока ТекущийСимвол = " " и Поз <= СтрДлинаСтр Цикл
				ТекущееСлово = ТекущееСлово + Символы.НПП;
				Поз = Поз + 1;
				ТекущийСимвол = Сред(вхСтр, Поз, 1);
			КонецЦикла;
			МассивРезультат.Добавить(Новый Структура("Строка, Цвет", ТекущееСлово, ""));
			
			ТекущееСлово = "";
			
		КонецЕсли;
		
		Если Найти(",()=+-*<>'", ТекущийСимвол) > 0 Тогда
			
			Если ЗначениеЗаполнено(ТекущееСлово) Тогда
				МассивРезультат.Добавить(ТекущееСлово);
			КонецЕсли;
			
			Если ТекущийСимвол = ">" Тогда
				МассивРезультат.Добавить(Новый Структура("Строка, Цвет", "&gt;", Цвет_КлючевыеСлова));
			Иначе
				МассивРезультат.Добавить(Новый Структура("Строка, Цвет", ТекущийСимвол, Цвет_КлючевыеСлова));
			КонецЕсли; 
			
			ТекущееСлово = "";
			
		ИначеЕсли ТекущийСимвол = """" Тогда
			
			Если ЗначениеЗаполнено(ТекущееСлово) Тогда
				МассивРезультат.Добавить(ТекущееСлово);
				ТекущееСлово = "";
			КонецЕсли;
			
			ТекущееСлово = """";
			Поз = Поз + 1;
			ТекущийСимвол = Сред(вхСтр, Поз, 1);
			
			Пока ТекущийСимвол <> """" и Поз <= СтрДлинаСтр Цикл
				ТекущееСлово = ТекущееСлово + ТекущийСимвол;
				Поз = Поз + 1;
				ТекущийСимвол = Сред(вхСтр, Поз, 1);
			КонецЦикла;
			МассивРезультат.Добавить(Новый Структура("Строка, Цвет", ТекущееСлово + """", Цвет_Строка));
			
			ТекущееСлово = "";
			
		Иначе
			
			ТекущееСлово = ТекущееСлово + ТекущийСимвол;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТекущееСлово) Тогда
		МассивРезультат.Добавить(ТекущееСлово);
	КонецЕсли; 
	
	Возврат МассивРезультат;
	
КонецФункции

&НаКлиенте
Функция форматирование_ЭтоПараметр(стрСлово)
	Возврат Лев(стрСлово,1) = "&"; 
КонецФункции

&НаКлиенте
Функция форматирование_ЭтоФункция(стрСлово)
	
	СписокКлючевыхСлов = ";ПРЕДСТАВЛЕНИЕССЫЛКИ;ДОБАВИТЬКДАТЕ;РАЗНОСТЬДАТ;И;ИЛИ;НЕ;ИСТИНА;ЛОЖЬ;NULL;НЕОПРЕДЕЛЕНО;МЕЖДУ;В;ИЕРАРХИИ;ЕСТЬ;ПОДОБНО;СПЕЦСИМВОЛ;СУММА;МАКСИМУМ;МИНИМУМ;СРЕДНЕЕ;КОЛИЧЕСТВО;ДАТАВРЕМЯ;ПОДСТРОКА;ГОД;МЕСЯЦ;ДЕНЬ;ЧАС;МИНУТА;СЕКУНДА;КВАРТАЛ;НЕДЕЛЯ;ДЕНЬГОДА;ДЕНЬНЕДЕЛИ;НАЧАЛОПЕРИОДА;КОНЕЦПЕРИОДА;ЕСТЬNULL;ВЫБОР;КОГДА;ТОГДА;ИНАЧЕ;КОНЕЦ;ВЫРАЗИТЬ;ЗНАЧЕНИЕ;ПРЕДСТАВЛЕНИЕ;OR;AND;NOT;TRUE;FALSE;UNDIFENED;BETWEEN;IN;HIERARCHY;REF;IS;LIKE;ESCAPE;SUM;MAX;MIN;AVD;COUNT;DATATIME;SUBSTRING;YEAR;MOUNT;DAY;HOUR;MINUTE;SECOND;QUARTER;WEEK;DAYYEAR;DAYWEEK;BEGINOFPERIOD;ENDOFPERIOD;ISNULL;CASE;WHEN;THEN;ELSE;END;CAST;VALUE;PRESENTATION;";
	Возврат Найти(СписокКлючевыхСлов, ";"+стрСлово+";");
	
КонецФункции

&НаКлиенте
Функция форматирование_ЭтоПолноеКлючевоеСлово(стрСлово)
	
	ПроверяемоеСлово = СокрЛП(стрСлово);
	
	Если 
		ПроверяемоеСлово = "ВЫБРАТЬ" ИЛИ 
		ПроверяемоеСлово = "ИЗ" ИЛИ 
		ПроверяемоеСлово = "ГДЕ" ИЛИ 
		ПроверяемоеСлово = "ОБЪЕДИНИТЬ ВСЕ" ИЛИ 
		ПроверяемоеСлово = "СГРУППИРОВАТЬ ПО" ИЛИ 
		ПроверяемоеСлово = "УПОРЯДОЧИТЬ ПО" ИЛИ 
		ПроверяемоеСлово = "ИТОГИ ПО" ИЛИ 
		ПроверяемоеСлово = "ВЫБРАТЬ РАЗЛИЧНЫЕ" ИЛИ 
		ПроверяемоеСлово = "ДЛЯ ИЗМЕНЕНИЯ" ИЛИ 
		ПроверяемоеСлово = "ИНДЕКСИРОВАТЬ ПО"  
		Тогда
		
		Возврат Истина; 
		
	КонецЕсли;
	
	Возврат Ложь; 
	
КонецФункции

&НаКлиенте
Функция форматирование_ЭтоКлючевоеСлово(стрСлово)
	
	ПроверяемоеСлово = СокрЛП(стрСлово);
	
	СписокКлючевыхСлов = ";КАК;СОЕДИНЕНИЕ;ЛЕВОЕ;ВЫБРАТЬ;РАЗЛИЧНЫЕ;ПЕРВЫЕ;ИЗ;ГДЕ;УПОРЯДОЧИТЬ;ПО;АВТОУПОРЯДОЧИВАНИЕ;СГРУППИРОВАТЬ;ИТОГИ;ОБЩИЕ;ПРАВОЕ;ПОЛНОЕ;ВНЕШНЕЕ;ВНУТРЕННЕЕ;УБЫВ;ВОЗР;ИМЕЮЩИЕ;ОБЪЕДИНИТЬ;ВСЕ;ДЛЯ;ИЗМЕНЕНИЯ;ПОМЕСТИТЬ;ИНДЕКСИРОВАТЬ;УНИЧТОЖИТЬ;БУЛЕВО;ЧИСЛО;ТОЛЬКО;ИЕРАРХИЯ;ПЕРИОДАМИ;ТИПЗНАЧЕНИЯ;SELECT;DESTINCT;TOP;FROM;WHERE;AS;ORDER;BY;AUTOORDER;GROUP;TOTALS;OVERALL;LEFT;RIGHT;FULL;OUTER;INNER;JOIN;ON;DESC;ASK;HAVING;UNION;ALL;FOR;UPDATE;OF;INTO;INDEX;DROP;BOOLEAN;NUMBER;ONLY;HIERARCHY;PERIODS;";
	Возврат Найти(СписокКлючевыхСлов, ";"+ПроверяемоеСлово+";");
	
КонецФункции

&НаКлиенте
Функция форматирование_ЭтоЧисло(стрСлово)
	
	ЛевСимв = Лев(стрСлово, 1);
	Если ЛевСимв >= "0" и ЛевСимв <= "9" Тогда
		Возврат Истина; 
	КонецЕсли; 
	
	Возврат Ложь; 
	
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.РежимСКД Тогда
		УстановитьДоступностьКнопокКонструктораЗапросов();
	иначе
		Если СокрЛП(Объект.ТекстЗапроса) <>"" Тогда
			ТекстЗапроса.УстановитьФорматированнуюСтроку(ПолучитьРаскрашенныйТекст(Объект.ТекстЗапроса));
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьКнопокКонструктораЗапросов()
	Элементы.Регистр.Доступность = НастройкаИсточникаДанных;
	Элементы.Таблица.Доступность = НастройкаИсточникаДанных;
	Элементы.Ресурс.Доступность = НастройкаИсточникаДанных;
	Элементы.КомпоновщикНастройкиОтбор.Доступность = не НастройкаИсточникаДанных;
КонецПроцедуры //

&НаКлиенте
Процедура ТекстЗапросаПриИзменении(Элемент)
	Модифицированность = Истина;
	Объект.ТекстЗапроса = СтрЗаменить(ТекстЗапроса.ПолучитьТекст(), Символы.НПП, " ");
	ТекстЗапроса.УстановитьФорматированнуюСтроку(ПолучитьРаскрашенныйТекст(Объект.ТекстЗапроса));
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметры(Команда)
	ЗаполнитьПараметрыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыНаСервере()
	Запрос = Новый Запрос(Объект.ТекстЗапроса);	
	
	Попытка
		мПараметрыЗапроса = Запрос.НайтиПараметры();
	Исключение
		ИА_БФКС.СообщениеОбОшибке(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Для Каждого ПараметрЗапроса Из мПараметрыЗапроса Цикл
		
		ИмяПараметра =  ПараметрЗапроса.Имя;
		М = СписокПараметров.НайтиСтроки(Новый Структура("ИмяПараметра", ИмяПараметра));
		Если М.Количество() > 0 Тогда
			СтрокаПараметров = М[0];
		Иначе
			СтрокаПараметров = СписокПараметров.Добавить();
			СтрокаПараметров.ИмяПараметра = ИмяПараметра;
		КонецЕсли; 
		СтрокаПараметров.Значение = ПараметрЗапроса.ТипЗначения.ПривестиЗначение(СтрокаПараметров.Значение);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СписокПараметровПриИзменении(Элемент)
	Модифицированность = истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокПараметровЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	тд = Элементы.СписокПараметров.ТекущиеДанные;
	Если тд.Значение = Неопределено Тогда
		Элемент.ВыбиратьТип = Истина;
	Иначе
		Элемент.ВыбиратьТип = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПараметровЗначениеОчистка(Элемент, СтандартнаяОбработка)
	Элемент.ВыбиратьТип = Истина;
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ЗаполнитьХранилищаЗначений(ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьХранилищаЗначений(ТекущийОбъект)
	тзПараметры = РеквизитФормыВЗначение("СписокПараметров");
	Хранилище = Новый ХранилищеЗначения(тзПараметры);
	ТекущийОбъект.ТабПараметровЗапроса = Хранилище;
	
	Если ЗначениеЗаполнено(АдресСКД) Тогда
		СКД_ = ПолучитьИзВременногоХранилища(АдресСКД);
		ХранилищеСКД = Новый ХранилищеЗначения(СКД_);
		ТекущийОбъект.ХранилищеСКД = ХранилищеСКД;	
	КонецЕсли; 
	
	Настройка = Компоновщик.Настройки;
	ХранилищеНастроек = Новый ХранилищеЗначения(Настройка);
	ТекущийОбъект.ХранилищеНастроек = ХранилищеНастроек;
КонецПроцедуры

&НаСервере
Процедура ПрочитатьПараметрыЗапросаНаСервере()
	
	Об = РеквизитФормыВЗначение("Объект");
	Хранилище = Об.ТабПараметровЗапроса;
	Знч = Хранилище.Получить();
	Если НЕ Знч = Неопределено Тогда
		ЗначениеВРеквизитФормы(Знч,"СписокПараметров");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.КонструкторСКД.Видимость = Объект.РежимСКД;
	Элементы.Запрос.Видимость = не Объект.РежимСКД;
	
	Элементы.ФормаРежим.Заголовок = "Режим: " + ?(Объект.РежимСКД,"Конструктор запроса","Запрос");
	
	
	Если Объект.РежимСКД Тогда
		
		НастройкаИсточникаДанных = не (ЗначениеЗаполнено(Объект.Регистр) и ЗначениеЗаполнено(Объект.Таблица) и ЗначениеЗаполнено(Объект.Ресурс));
		Элементы.Применить.Заголовок = ?(НастройкаИсточникаДанных,"Применить","Редактировать");
		
		ЗаполнитьВыпадающиеСписки("Регистр");
		ЗаполнитьВыпадающиеСписки("Таблица");
		ЗаполнитьВыпадающиеСписки("Ресурс");
		
		СКД = ОБъект.Ссылка.ХранилищеСКД.Получить();
		
		Если СКД <> Неопределено Тогда
			АдресСКД = ПоместитьВоВременноеХранилище(СКД, ЭтаФорма.УникальныйИдентификатор);
			
			Настройка = Объект.Ссылка.ХранилищеНастроек.Получить();
			Если Настройка <> Неопределено Тогда
				АдресНастроек = ПоместитьВоВременноеХранилище(Настройка,ЭтаФорма.УникальныйИдентификатор);
			КонецЕсли; 
			
			Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСКД));
			Если Настройка <> Неопределено Тогда
				Компоновщик.ЗагрузитьНастройки(Настройка);
			иначе
				Компоновщик.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
			КонецЕсли;	
		КонецЕсли; 
		
	иначе
		ПрочитатьПараметрыЗапросаНаСервере();	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ПротестироватьНаСервере(ПараметрыПредопределенные)
	
	Запрос = Новый Запрос;
	Запрос.Текст = Объект.ТекстЗапроса;
	
	Для каждого КиЗ Из ПараметрыПредопределенные Цикл
		Запрос.УстановитьПараметр(КиЗ.Ключ, КиЗ.Значение);
	КонецЦикла;  
	
	Для каждого Стр Из СписокПараметров Цикл
		Запрос.УстановитьПараметр(Стр.ИмяПараметра, Стр.Значение);
	КонецЦикла;  
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Заголовок = "Результат: '" + Объект.Наименование + "'. Параметры: " + ИА_БФКС.Струк_Представление(ПараметрыПредопределенные);
	ТабДок = ИА_БФС.ТЗ_ВывестиВТабДок(ТЗ, Заголовок);
	
	Данные = Новый Структура("ТабДок, Заголовок", ТабДок, Заголовок);
	
	Возврат Данные
КонецФункции

&НаКлиенте
Процедура Протестировать(Команда)	
	ДопПарам = Новый Структура("ДатаНачала, ДатаКонца, Организация,ТекВвод", Неопределено, Неопределено, Неопределено,"ДатаНачала");
	ОпОп = Новый ОписаниеОповещения("ПротестироватьОбработчик",ЭтаФорма,ДопПарам);
	ТекЗн = НачалоДня(ТекущаяДата()) - 86400*7;
	ПоказатьВводЗначения(ОпОп,ТекЗн, "Введите дату начала анализа");  
КонецПроцедуры

&НаКлиенте
Процедура ПротестироватьОбработчик(Значение, ДопПараметры) Экспорт
	Если Значение = Неопределено ТОгда
		Возврат;
	КонецЕсли;
	
	ДопПараметры[ДопПараметры.ТекВвод] = Значение;
	
	ТекЗн = Неопределено;
	Если ДопПараметры.ТекВвод = "ДатаНачала" Тогда
		ДопПараметры.ТекВвод = "ДатаКонца";
		ЗаголовокВопр = "Введите дату конца анализа";
		ТекЗн = ТекущаяДата();
	ИначеЕсли  ДопПараметры.ТекВвод = "ДатаКонца" Тогда
		ДопПараметры.ТекВвод = "Организация";
		ЗаголовокВопр = "Введите организацию";
		ТекЗн = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
	ИначеЕсли ДопПараметры.ТекВвод = "Организация" Тогда
		ДопПараметры.Удалить("ТекВвод");
		ТабДок = ВыполнитьПротестироватьНаСервере(ДопПараметры);
		Если ТабДок <> Неопределено Тогда
			ТабДок.Показать();
		КонецЕсли; 
	КонецЕсли;
	
	Если ТекЗн <> Неопределено Тогда
		ОпОп = Новый ОписаниеОповещения("ПротестироватьОбработчик",ЭтаФорма,ДопПараметры);
		ПоказатьВводЗначения(ОпОп,ТекЗн, ЗаголовокВопр);  
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьПротестироватьНаСервере(ПараметрыПредопределенные)
	
	Об = РеквизитФормыВЗначение("Объект");
	ЗаполнитьХранилищаЗначений(Об);	
	Данные = КСУ_ФП_Веб_Общее.ВыполнитьЗапрос(Об, ПараметрыПредопределенные);	
	
	Если НЕ Данные.Выполнен Тогда
		ИА_БФКС.СообщениеОбОшибке("При выполнении возникла ошибка: " + Данные.ТекстОшибки);
	Иначе
		ТабДок = Новый ТабличныйДокумент;
		
		ТЗ = ИА_БФС.ТЗ_НоваяТаблицаЗначений("Ключ, Значение");
		Для каждого КиЗ Из Данные.Параметры Цикл
			ЗаполнитьЗначенияСвойств(ТЗ.Добавить(), КиЗ);
		КонецЦикла; 
		
		ТабДок.Вывести(ИА_БФС.ТЗ_ВывестиВТабДок(ТЗ, "Параметры запроса:", Ложь, Истина, Истина));
		ТабДок.Вывести(ИА_БФС.ТЗ_ВывестиВТабДок(Данные.Таб, "Результат:", Ложь, Истина, Истина));
		
		Возврат ТабДок;
	КонецЕсли; 
	
КонецФункции


&НаКлиенте
Процедура РегистрПриИзменении(Элемент)
	ЗаполнитьВыпадающиеСписки("Таблица");
	Объект.Таблица = "";
	Объект.Ресурс = "";	
КонецПроцедуры

&НаСервере
Процедура ПрименитьНаСервере()
	
	СКД = Новый СхемаКомпоновкиДанных; 
	
	
	// определим источник данных для схемы 
	Источник = СКД.ИсточникиДанных.Добавить();
	Источник.Имя = "ЛокальнаяБаза";
	Источник.СтрокаСоединения = "";
	Источник.ТипИсточникаДанных = "Local"; 
	
	НаборДанных = СКД.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Имя = "Продажи";
	НаборДанных.ИсточникДанных = "ЛокальнаяБаза";
	НаборДанных.АвтоЗаполнениеДоступныхПолей = Истина; 
	
	РегНакопления = Лев(Объект.Регистр,17) = "РегистрНакопления";
	ТипЗначения = ?(РегНакопления,Сокрлп(Сред(Объект.Таблица,СтрДлина(Объект.регистр) - 17)),Сокрлп(Сред(Объект.Таблица,СтрДлина(Объект.регистр) - 18)));
	
	ВременныйТекст =  "ВЫБРАТЬ *,
	|" + Объект.Таблица + "." + Объект.Ресурс + " как РесурсЗначение
	|ИЗ
	|" + Объект.регистр + ?(ТипЗначения = "","","." + типЗначения)
	+ ?(ТипЗначения = "Остатки","()",?(ТипЗначения = "ОстаткиИОбороты","(,)",?(ТипЗначения = "Обороты","(,)","")))
	+ " КАК " + Объект.Таблица + "
	|";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ВременныйТекст + "Где ложь";
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	НаборДанных.Запрос =(
	
	"ВЫБРАТЬ *,
	|" + Объект.Таблица + "." + Объект.Ресурс + " как РесурсЗначение
	|ИЗ
	|" + Объект.регистр + ?(ТипЗначения = "","","." + типЗначения)
	//+ ?(ТипЗначения = "Остатки","(&ДатаКонца)",?(ТипЗначения = "ОстаткиИОбороты","(&ДатаНачала,&ДатаКонца)",?(ТипЗначения = "Обороты","(&ДатаНачала,&ДатаКонца)","")))
	+ ?(ТипЗначения = "Остатки","(&ДатаКонца)",?(ТипЗначения = "ОстаткиИОбороты" ИЛИ ТипЗначения = "ДвиженияССубконто","(&ДатаНачала,&ДатаКонца)",?(ТипЗначения = "Обороты","(&ДатаНачала,&ДатаКонца)","")))
	+ " КАК " + Объект.Таблица + "
	|" + ?(ТипЗначения = "", "ГДЕ "  + Объект.Таблица + ".Период между &ДатаНачала и &ДатаКонца","") + "
	|"    
	
	);
	
	// добавим поля
	НаборДанных.АвтоЗаполнениеДоступныхПолей = Истина;
	
	Для каждого ТекКолонка Из ТЗ.Колонки Цикл
		ПолеНабораДанных             = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		ПолеНабораДанных.Заголовок   = ТекКолонка.Заголовок;
		ПолеНабораДанных.ПутьКДанным = ТекКолонка.Заголовок;
		ПолеНабораДанных.Поле        = ТекКолонка.Заголовок;	
	КонецЦикла;
	
	// определим пареметры  
	ПараметрДанных               = СКД.Параметры.Добавить();
	ПараметрДанных.Имя           = "ДатаНачала";
	ПараметрДанных.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
	ПараметрДанных.Заголовок     = "Дата начала";
	ПараметрДанных.ВключатьВДоступныеПоля = Истина;
	
	ПараметрДанных               = СКД.Параметры.Добавить();
	ПараметрДанных.Имя           = "ДатаКонца";
	ПараметрДанных.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
	ПараметрДанных.Заголовок     = "Дата окончания";
	ПараметрДанных.ВключатьВДоступныеПоля = Истина;
	
	// получим настройки для схемы 
	НастройкиСКД = СКД.НастройкиПоУмолчанию;
	
	ГруппировкаНоменклатуры = НастройкиСКД.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	АвтоПолеГруппировки = ГруппировкаНоменклатуры.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	АвтоПолеГруппировки.Использование = Истина;
	
	Для каждого ТекКолонка Из ТЗ.Колонки Цикл
		ВыбранноеПоле = НастройкиСКД.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Заголовок = ТекКолонка.Заголовок;
		ВыбранноеПоле.Использование = Истина;
		ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных(ТекКолонка.Заголовок);	
	КонецЦикла; 
	
	АдресСКД = ПоместитьВоВременноеХранилище(СКД, ЭтаФорма.УникальныйИдентификатор);
	
	Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСКД));
	Компоновщик.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)
	Если не НастройкаИсточникаДанных Тогда
		Если Компоновщик.Настройки.Отбор.Элементы.Количество() Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ВопросПрименить", ЭтаФорма);
			ПоказатьВопрос(ОписаниеОповещения, "При переходе в режим редактирования будут удалены отборы. Продолжить?",РежимДиалогаВопрос.ДаНет, 60);
		иначе
			УправлениеВидимостьюПрименить();
		КонецЕсли; 	
	иначе
		Если ЗначениеЗаполнено(Объект.Регистр) и ЗначениеЗаполнено(Объект.Таблица) и ЗначениеЗаполнено(Объект.Ресурс) Тогда
			УправлениеВидимостьюПрименить();
		иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не заполнены все обязательные данные для формирования СКД";
			Сообщение.Сообщить(); 
		КонецЕсли; 	
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПрименить(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		УправлениеВидимостьюПрименить();	
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
процедура УправлениеВидимостьюПрименить()
	НастройкаИсточникаДанных = Не НастройкаИсточникаДанных;
	УстановитьДоступностьКнопокКонструктораЗапросов();
	Элементы.Применить.Заголовок = ?(НастройкаИсточникаДанных,"Применить","Редактировать");
	Если не НастройкаИсточникаДанных Тогда
		ПрименитьНаСервере();	
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура Режим(Команда)
	Объект.РежимСКД = не Объект.РежимСКД;
	Элементы.КонструкторСКД.Видимость = Объект.РежимСКД;
	Элементы.Запрос.Видимость = не Объект.РежимСКД;
	
	Элементы.ФормаРежим.Заголовок = "Режим: " + ?(Объект.РежимСКД,"Конструктор запроса","Запрос");
	Если Объект.РежимСКД Тогда
		НастройкаИсточникаДанных = не (ЗначениеЗаполнено(Объект.Регистр) и ЗначениеЗаполнено(Объект.Таблица) и ЗначениеЗаполнено(Объект.Ресурс));
		УстановитьДоступностьКнопокКонструктораЗапросов();
		ЗаполнитьВыпадающиеСписки("Регистр");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПриИзменении(Элемент)
	ЗаполнитьВыпадающиеСписки("Ресурс");
	Объект.Ресурс = "";	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВыпадающиеСписки(ИмяПоля)
	Если ИмяПоля = "Регистр" Тогда
		СписокРегистров = Новый Массив;
		Для Каждого МетаданныеРегистр Из Метаданные.РегистрыНакопления Цикл
			
			Если МетаданныеРегистр.Ресурсы.Количество()=0 Тогда
				Продолжить;
			КонецЕсли;
			
			СписокРегистров.Добавить("РегистрНакопления."+МетаданныеРегистр.Имя); 
			
		КонецЦикла;
		
		Для Каждого МетаданныеРегистр Из Метаданные.РегистрыБухгалтерии Цикл
			
			Если МетаданныеРегистр.Ресурсы.Количество()=0 Тогда
				Продолжить;
			КонецЕсли;
			
			СписокРегистров.Добавить("РегистрБухгалтерии."+МетаданныеРегистр.Имя);
			
		КонецЦикла;
		
		Элементы.Регистр.СписокВыбора.ЗагрузитьЗначения(СписокРегистров);
	ИначеЕсли ИмяПоля = "Таблица" Тогда
		СписокТаблиц = Новый Массив;
		Если Лев(Объект.Регистр,17) = "РегистрНакопления" Тогда
			
			СписокТаблиц.Добавить(Сред(Объект.Регистр,19)); 
			
			Если Метаданные.РегистрыНакопления[Сред(Объект.Регистр,19)].ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки Тогда
				СписокТаблиц.Добавить(Сред(Объект.Регистр,19) + "Остатки");
				СписокТаблиц.Добавить(Сред(Объект.Регистр,19) + "ОстаткиИОбороты");
				СписокТаблиц.Добавить(Сред(Объект.Регистр,19) + "Обороты");
			иначе
				СписокТаблиц.Добавить(Сред(Объект.Регистр,19) + "Обороты");	
			КонецЕсли;  
		ИначеЕсли Лев(Объект.Регистр,18) = "РегистрБухгалтерии" Тогда
			
			СписокТаблиц.Добавить(Сред(Объект.Регистр,20));
			СписокТаблиц.Добавить(Сред(Объект.Регистр,20) + "ДвиженияССубконто");
			СписокТаблиц.Добавить(Сред(Объект.Регистр,20) + "Остатки");
			СписокТаблиц.Добавить(Сред(Объект.Регистр,20) + "ОстаткиИОбороты");
			СписокТаблиц.Добавить(Сред(Объект.Регистр,20) + "Обороты");
			СписокТаблиц.Добавить(Сред(Объект.Регистр,20) + "ОборотыДтКт");
			
		КонецЕсли;
		
		Элементы.Таблица.СписокВыбора.ЗагрузитьЗначения(СписокТаблиц);
	иначеЕсли ИмяПоля = "Ресурс" Тогда
		СписокРесурсов = Новый Массив;
		Если Лев(Объект.Регистр,17) = "РегистрНакопления" Тогда
			
			ТипЗначения = Сокрлп(Сред(Объект.Таблица,СтрДлина(Объект.регистр) - 17)); 
			ТипРегОстатки = Метаданные.РегистрыНакопления[Сред(Объект.Регистр,19)].ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки;
			
			Для каждого Текстрока Из Метаданные.РегистрыНакопления[Сред(Объект.Регистр,19)].Ресурсы Цикл
				Если ТипЗначения = "" Тогда
					
					СписокРесурсов.Добавить(Текстрока.Имя);	
					
				иначеЕсли ТипЗначения = "Остатки" Тогда
					СписокРесурсов.Добавить(Текстрока.Имя + "Остаток");
					
				ИначеЕсли  ТипЗначения = "ОстаткиИОбороты"  Тогда
					СписокРесурсов.Добавить(Текстрока.Имя + "Оборот");
					СписокРесурсов.Добавить(Текстрока.Имя + "Приход");
					СписокРесурсов.Добавить(Текстрока.Имя + "Расход");
					СписокРесурсов.Добавить(Текстрока.Имя + "НачальныйОстаток");
					СписокРесурсов.Добавить(Текстрока.Имя + "КонечныйОстаток");
					
				иначеЕсли  ТипЗначения = "Обороты" тогда
					
					СписокРесурсов.Добавить(Текстрока.Имя + "Оборот");					
					
					Если ТипРегОстатки Тогда
						СписокРесурсов.Добавить(Текстрока.Имя + "Приход");
						СписокРесурсов.Добавить(Текстрока.Имя + "Расход");
					КонецЕсли;
				КонецЕсли; 
				
			КонецЦикла; 
		ИначеЕсли Лев(Объект.Регистр,18) = "РегистрБухгалтерии" Тогда
			
			ТипЗначения = Сокрлп(Сред(Объект.Таблица,СтрДлина(Объект.регистр) - 18)); 
			
			Для каждого Текстрока Из Метаданные.РегистрыБухгалтерии[Сред(Объект.Регистр,20)].Ресурсы Цикл
				Если ТипЗначения = "" или ТипЗначения = "ДвиженияССубконто" тогда
					СписокРесурсов.Добавить(Текстрока.Имя);
					
				ИначеЕсли ТипЗначения = "Остатки" Тогда
					СписокРесурсов.Добавить(Текстрока.Имя + "Остаток");
					СписокРесурсов.Добавить(Текстрока.Имя + "ОстатокДт");
					СписокРесурсов.Добавить(Текстрока.Имя + "ОстатокКт");
					СписокРесурсов.Добавить(Текстрока.Имя + "РазвернутыйОстатокДт");
					СписокРесурсов.Добавить(Текстрока.Имя + "РазвернутыйОстатокКт");
					
				ИначеЕсли  ТипЗначения = "ОстаткиИОбороты"  Тогда
					СписокРесурсов.Добавить(Текстрока.Имя + "Остаток");
					СписокРесурсов.Добавить(Текстрока.Имя + "ОстатокДт");
					СписокРесурсов.Добавить(Текстрока.Имя + "ОстатокКт");
					СписокРесурсов.Добавить(Текстрока.Имя + "РазвернутыйОстатокДт");
					СписокРесурсов.Добавить(Текстрока.Имя + "РазвернутыйОстатокКт");
					СписокРесурсов.Добавить(Текстрока.Имя + "НачальныйОстаток");
					СписокРесурсов.Добавить(Текстрока.Имя + "НачальныйОстатокДт");
					СписокРесурсов.Добавить(Текстрока.Имя + "НачальныйОстатокКт");
					СписокРесурсов.Добавить(Текстрока.Имя + "НачальныйРазвернутыйОстатокДт");
					СписокРесурсов.Добавить(Текстрока.Имя + "НачальныйРазвернутыйОстатокКт");
					СписокРесурсов.Добавить(Текстрока.Имя + "КонечныйОстаток");
					СписокРесурсов.Добавить(Текстрока.Имя + "КонечныйОстатокДт");
					СписокРесурсов.Добавить(Текстрока.Имя + "КонечныйОстатокКт");
					СписокРесурсов.Добавить(Текстрока.Имя + "КонечныйРазвернутыйОстатокДт");
					СписокРесурсов.Добавить(Текстрока.Имя + "КонечныйРазвернутыйОстатокКт");
					
				иначеЕсли  ТипЗначения = "Обороты" тогда
					СписокРесурсов.Добавить(Текстрока.Имя + "Оборот");
					СписокРесурсов.Добавить(Текстрока.Имя + "ОборотДт");
					СписокРесурсов.Добавить(Текстрока.Имя + "ОборотКт");
					
				КонецЕсли;
			КонецЦикла;
		КонецЕсли; 
		
		Элементы.Ресурс.СписокВыбора.ЗагрузитьЗначения(СписокРесурсов);
	КонецЕсли;
	
КонецПроцедуры
